Core/src/Catalogs/ДЛ_ВидыУниверсальныхОтчетов/ДЛ_ВидыУниверсальныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_ВидыУниверсальныхОтчетов</name>
  <attributes>
    <name>ЦветФонаШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтШапки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/ДЛ_ВидыУниверсальныхОтчетов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЦветФона = Объект.Ссылка.ЦветФонаШапки.Получить();
		ЦветТекста = Объект.Ссылка.ЦветТекстаШапки.Получить();
		ШрифтШапки = Объект.Ссылка.ШрифтШапки.Получить();
	Иначе
		ЦветФона = Новый Цвет(255, 255, 255);
		ЦветТекста = Новый Цвет(0, 0, 0);
		ШрифтШапки = Новый Шрифт("Arial", 8);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФонаШапки = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекстаШапки = Новый ХранилищеЗначения(ЦветТекста);
	ТекущийОбъект.ШрифтШапки = Новый ХранилищеЗначения(ШрифтТекста);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
